{
  "Glaucus_atlanticus": {
    "species_name": "Glaucus atlanticus",
    "common_name": "Blue dragon, sea swallow, blue sea slug",
    "image_filename": "Glaucus_atlanticus.jpg",
    "location_distribution": "Pelagic zone (open ocean), carried by winds and currents; primarily tropical and subtropical areas. Documented sightings include Bay of Bengal, off Tamil Nadu and Andhra Pradesh in India. Populations are localized within distinct ocean basins.",
    "depth": "Surface waters, typically floating on the ocean surface.",
    "habitat": "Open ocean surface.",
    "size_mm": "30",
        "taxonomy": {
        "order": "Nudibranchia",
        "family": "Glaucidae"
        },
    "diet": "Cnidarians, including venomous siphonophores like the Portuguese man o' war. Uses a radula with serrated teeth, strong jaw, and denticles to grasp and chip prey.",
    "interesting_facts": "Glaucus atlanticus is a pelagic sea slug that floats on the ocean surface, feeding on jellyfish and other cnidarians. It has a unique ability to store the stinging cells (nematocysts) of its prey in its own tissues",
    "color_notes": "Ventral side (upwards) is dark and pale blue; true dorsal surface (downwards) is silvery grey. Features dark blue stripes on its head. Dorsal area of foot varies from dark blue to brown with a silver central position.",
    "classification_type": "",
    "pic_link": ""
  },

  "Berghia_coerulescens": {
    "species_name": "Berghia coerulescens",
    "common_name": "Berghia nudibranch",
    "image_filename": "Berghia_coerulescens.jpg",
    "location_distribution": "Eastern Atlantic Ocean and Mediterranean Sea. Originally from French Mediterranean coast, found in central and western Mediterranean (including Adriatic Sea), and Atlantic coasts from Brittany to Canary Islands.",
    "depth": "Shallow waters, benthic zone (prey habitat).",
    "habitat": "Marine, shallow waters, typically under rocks and corals.",
    "size_mm": "50",
    "taxonomy": {
      "order": "Nudibranchia",
      "family": "Aeolidiidae"
    },
    "diet": "Strictly Aiptasia anemones. Can obtain short-term sustenance from zooxanthellae from prey.",
    "interesting_facts": "Berghia coerulescens is a popular subject in marine aquariums. It has a specialized diet, primarily feeding on Aiptasia anemones, which makes it a valuable species for controlling these pests in reef tanks.",
    "color_notes": "Body is white, cerata are light blue with yellow tips. May have orange marks on the head between rhinophores and oral tentacles. Rhinophore clubs are orange-brown. Pigmentation develops from consuming anemones, harvesting color from food.",
    "classification_type": "",
    "pic_link": ""
  },

  "Costasiella_kuroshimae": {
    "species_name": "Costasiella kuroshimae",
    "common_name": "Kuroshima slug",
    "image_filename": "Costasiella_kuroshimae.jpg",
    "location_distribution": "Indo-Pacific, including waters near Japan (Kuroshima, Okinawa), the Philippines, Indonesia, Northern Mariana Islands (Saipan), and Australia (Heron Island, Great Barrier Reef).",
    "depth": "1.5 m; also found in intertidal zones at low tide.",
    "habitat": "Tropical climates, marine; often associated with leaf-like green algae (Avrainvillea genus) on sandy bottoms between reefs, and eelgrass beds.",
    "size_mm": "8",
    "taxonomy": {
      "order": "Nudibranchia",
      "family": "Costasiellidae"
    },
    "diet": "Selective feeder, exclusively consuming algae from the genus Avrainvillea.",
    "interesting_facts": "Costasiella kuroshimae is known for its unique appearance and behavior. It is often found on the underside of leaves and is capable of photosynthesis due to the presence of chloroplasts from the algae it consumes.",
    "color_notes": "Background color is cream with white patches. White head with dark midline marks and a dark streak in front of rhinophores; may have dark grey-black streak behind eyes. Rhinophores are white with black tips. Cerata are generally green with white tips and iridescent bright blue spots. Some specimens have orange rings or spots on cerata. Coloration can vary based on feeding status, with green color derived from digestive gland contents (chloroplasts).",
    "classification_type": "",
    "pic_link": ""
  },

  "Chromodoris_willani": {
    "species_name": "Chromodoris willani",
    "common_name": "Willan's chromodorid",
    "image_filename": "Chromodoris_willani.jpg",
    "location_distribution": "Western Pacific Ocean, from Indonesia and the Philippines to Vanuatu.",
    "depth": "Not specified in available information.",
    "habitat": "Marine, likely reef communities.",
    "size_mm": "25",
    "taxonomy": {
      "order": "Nudibranchia",
      "family": "Chromodorididae"
    },
    "diet": "Sponges, specifically Cacospongia mycofijiensis and Semitaspongia (family Thorectidae).",
    "interesting_facts": "Chromodoris willani is known for its vibrant coloration and is often found in shallow reef environments.",
    "color_notes": "Ranges from dark blue to translucent white. Features black stripes, with the center-most stripe typically non-continuous. Distinguished by prominent white specks on gills and rhinophores. Observed color forms include pale blue, white, blue, and browny.",
    "classification_type": "",
    "pic_link": ""
  },

  "Phidiana_militaris": {
    "species_name": "Phidiana militaris",
    "common_name": "Military nudibranch",
    "image_filename": "Phidiana_militaris.jpg",
    "location_distribution": "Indo-Pacific (tropical and subtropical), including India (original description), Oman, New Zealand, Hong Kong, Thailand, Borneo, Philippines, Australia, and Japan. Also found in Mediterranean Sea as a Lessepsian migrant via Suez Canal (e.g., Haifa Bay, Israel).",
    "depth": "15-22 m; also in shallow rockpools",
    "habitat": "Marine, shallow coastal waters, often associated with coral reefs, rocky substrates, hydroids, and Sargassum sp.",
    "size_mm": "18-35",
    "taxonomy": {
      "order" : "Nudibranchia", 
      "family" : "Aeolidiidae"
    },
    "diet": "Carnivorous, preying on small invertebrates such as polyps, hydroids, and other soft-bodied organisms.",
    "interesting_facts": "Phidiana militaris is known for its striking coloration and is often found in association with hydroids.",
    "color_notes": "Body typically brown or reddish-brown. Features a bright orange median line on the head that forks anteriorly, extending up each oral tentacle. Another orange line runs along the posterior edge of oral tentacles and along each side of the body below the cerata. Oral tentacles, rhinophores, tentacular foot corners, and cerata are tipped with yellow. Rhinophores have a broad orange band. Possesses a very striking color pattern.",
    "classification_type": "",
    "pic_link": ""
  },

  "Felimare_cantabrica": {
    "species_name": "Felimare cantabrica",
    "common_name": "Cantabrian chromodorid",
    "image_filename": "Felimare_cantabrica.jpg",
    "location_distribution": "Eastern Atlantic Ocean, specifically Bay of Biscay and Atlantic coasts of Spain and Portugal. Also restricted to the Mediterranean Sea.",
    "depth": "Not specified in available information.",
    "habitat": "Marine, rocky reefs.",
    "size_mm": "40",
    "taxonomy": { 
      "order": "Nudibranchia",
      "family": "Chromodorididae"
    },
    "diet": "Sponges, specifically from the genus Dysidea. Characterized as a foraging predator.",
    "interesting_facts": "Felimare cantabrica is found in rocky reef habitats.",
    "color_notes": "Light and dark blue body, flecked with yellow lines and spots. Mantle edge lined with yellow-light blue-yellow banding. Gills and rhinophores are purple.",
    "classification_type": "",
    "pic_link": ""
  },

  "Nembrotha_cristata": {
    "species_name": "Nembrotha cristata",
    "common_name": "Crested nembrotha",
    "image_filename": "Nembrotha_cristata.jpg",
    "location_distribution": "Tropical Indo-West Pacific Ocean, including the Philippines (original description), Indonesia, and Malaysia (Tioman).",
    "depth": "3-20 m.",
    "habitat": "Marine, coral or rock reefs.",
    "size_mm": "50",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "Compound tunicates, specifically green compound ascidians like Eudistoma olivaceum or Sigillina signifera.",
    "interesting_facts": "Nembrotha cristata is known for its striking appearance and is often found in shallow coral reef habitats. It has a unique feeding behavior, primarily consuming compound tunicates.",
    "color_notes": "Black body with raised green nodules. Rhinophores and gills are black-edged in green. Foot border is green.", 
    "classification_type": "",
    "pic_link": ""
  },

  "Paraflabellina_ischitana": {
    "species_name": "Paraflabellina ischitana",
    "common_name": "Ischitan Flabellina, Orange-Lobed Flabellina",
    "image_filename": "Paraflabellina_ischitana.jpg",
    "location": "Mediterranean Sea (Italy, Spain, France) and Eastern Atlantic (Portugal, Canary Islands)",
    "depth_m": "30",
    "habitat": "Rocky bottoms, subtidal, sublittoral, infralittoral zones, often associated with hydroids",
    "size_mm": "35",
    "taxonomy": {
      "family": "Flabellinidae",
      "order": "Nudibranchia"
    },
    "diet": "Hydroids (Eudendrium species, e.g., Eudendrium racemosum, Eudendrium glomeratum)",
    "interesting_facts": "Named after Ischia island where it was first described. It was reclassified from the genus Flabellina to Paraflabellina in 2017, with P. ischitana designated as the type species for the new genus.",
    "color_notes": "Translucent white to violet-purple body with opaque white-tipped cerata, rhinophores, and oral tentacles. Cerata have purple tips and orange rings, revealing red-orange branches of the digestive gland.",
    "classification_type": "",
    "pic_link": "" 
  },
  
  "Nembrotha_kubaryana": {
    "species_name": "Nembrotha kubaryana",
    "common_name": "Variable Nembrotha, Kubary's Nembrotha, Dusky Nembrotha, Variable Neon Slug",
    "image_filename": "Nembrotha_kubaryana.jpg",
    "location": "Indo-Pacific region, from East Africa to the Western Pacific (including Red Sea, Indonesia, Philippines, Australia, Japan)",
    "depth_m": "5-30",
    "habitat": "Coral reefs and rocky reefs, often on open reefs with ascidians",
    "size_mm": "100",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "Colonial tunicates (ascidians), including Eudistoma and Sigillina signifera",
    "interesting_facts": "Known for its aposematic coloration, it sequesters toxins from its tunicate diet and secretes them as a slimy mucus for defense. Historically, Nembrotha nigerrima was considered a synonym, but N. kubaryana was chosen as the senior synonym.",
    "color_notes": "Dark green-black body with green pustules or lines. Foot and head border are vivid red-orange. Rhinophores and gills vary from orange to green, often with orange rhinophores and a ring around the sheath.",
    "classification_type": "",
    "pic_link": ""
  },

  "Nembrotha_purpureolineata": {
    "species_name": "Nembrotha purpureolineata",
    "common_name": "Purple-lined Nembrotha",
    "image_filename": "Nembrotha_purpureolineata.jpg",
    "location": "Tropical Indo-West Pacific Ocean (including Indonesia, Philippines, Papua New Guinea, Western Australia)",
    "depth_m": "6-14",
    "habitat": "Coral reefs, rocky substrates, rocky sandy bottoms with weeds and algae",
    "size_mm": "90",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "Ascidians and tunicates, specifically the yellow-lined ascidian Clavelina meridionalis",
    "interesting_facts": "First described from a preserved specimen in 1924. Its synonym, Nembrotha rutilans, was based solely on a painting, leading to N. purpureolineata being given precedence. Its distinctive purple lines make it easily identifiable.",
    "color_notes": "Creamy white body with prominent longitudinal purple lines, often obscured by a large brown dorsal patch. Brown stripes usually run down the sides of the body and a brown band is found around the head. Rhinophores are red or orange-red with pink or purple stalks. Gills are orange or reddish-orange. Foot often faintly edged with purple.",
    "classification_type": "",
    "pic_link": ""
  },

  "Hypselodoris_kanga": {
    "species_name": "Hypselodoris kanga",
    "common_name": "Kanga's Hypselodoris",
    "image_filename": "Hypselodoris_kanga.jpg",
    "location": "Indian Ocean (Tanzania, Mozambique). Pacific Ocean specimens previously identified as H. kanga are now considered other species.",
    "depth_m": "5",
    "habitat": "Coral reefs, rocky reefs, benthic zone near sponges",
    "size_mm": "60",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (likely from the family Dysideidae)",
    "interesting_facts": "Part of a species complex, often confused with similar species like H. bullockii, H. confetti, and H. roo. It is distinguished from these by specific gill morphology.",
    "color_notes": "Blue-grey body covered in black and yellow spots, with black spots bordered by blue at the mantle edge. Rhinophores are red with deep blue stalks. Gills are triangular, with reddish-orange, deep blue, and white sections, and yellow spots on the outer side.",
    "classification_type": "",
    "pic_link": ""
  },

  "Nembrotha_megalocera": {
    "species_name": "Nembrotha megalocera",
    "common_name": "Megalocera Nembrotha",
    "image_filename": "Nembrotha_megalocera.jpg",
    "location": "Red Sea",
    "depth_m": "8-20",
    "habitat": "Coral reefs and rocky reefs",
    "size_mm": "65",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "Colonial ascidians (tunicates)",
    "interesting_facts": "First described in 1990, this species is known only from the Red Sea. It is characterized by its relatively large rhinophores compared to its body size.",
    "color_notes": "Black dorsum with a lemon yellow head and gill area. Flank is orange, turning white near the bluish-violet foot margin. Oral tentacles, gill bases, and rhinophores are bluish-violet, with red gill tips and black rhinophores. Rhinophores are notably large.",
    "classification_type": "",
    "pic_link": ""
  },

  "Flabellina_iodinea": {
    "species_name": "Flabellina iodinea",
    "common_name": "Spanish Shawl, Purple Aeolis",
    "image_filename": "Flabellina_iodinea.jpg",
    "location": "Eastern Pacific Ocean, from British Columbia, Canada, to Baja California, Mexico, including the Gulf of California and Galapagos Islands",
    "depth_m": "0-40",
    "habitat": "Rocky intertidal zones, kelp forests, and subtidal reefs",
    "size_mm": "70",
    "taxonomy": {
      "family": "Flabellinidae",
      "order": "Nudibranchia"
    },
    "diet": "Hydroids (Eudendrium species, e.g., Eudendrium ramosum)",
    "interesting_facts": "Known as the 'Spanish Shawl' due to its flowing cerata. Its vibrant colors (purple body, orange cerata, scarlet rhinophores) are derived from astaxanthin sequestered from its hydroid diet. Can swim by flexing its body to escape predators like sea stars and is mimicked by the amphipod crustacean Podocerus cristatus. Recently reclassified to Flabellinopsis iodinea.",
    "color_notes": "Purple body, scarlet red rhinophores, and orange cerata. The cerata are red-orange at the base, gradually fading to purple or violet at the tips. All colors are derived from astaxanthin sequestered from its hydroid diet.",
    "classification_type": "",
    "pic_link": ""
  },

  "Goniobranchus_kuniei": {
    "species_name": "Goniobranchus kuniei",
    "common_name": "Kunie's Chromodoris",
    "image_filename": "Goniobranchus_kuniei.jpg",
    "location": "Western Pacific Ocean and Eastern Indian Ocean (including New Caledonia, Fiji, Marshall Islands, Australia, Papua New Guinea, Indonesia, Malaysia, Philippines, Taiwan, Japan, Red Sea)",
    "depth_m": "5-40",
    "habitat": "Coral reefs, rocky reefs, and sometimes sand or mud bottoms",
    "size_mm": "40",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges",
    "interesting_facts": "Previously known as Chromodoris kuniei, its genus Goniobranchus was reinstated in 2012 based on molecular (DNA) techniques. Its bright, varied color patterns may signal toxicity to predators, and it shares similar patterns with Goniobranchus tritos and Goniobranchus geminus.",
    "color_notes": "Pale blue or yellowish body with small, rounded tubercles and bright orange or red spots. Mantle has a striking pattern of blue spots with pale blue halos, and a double border of purple and blue. Mantle edge often bordered with a thin orange or yellow line. Gills and rhinophores are orange or red.",
    "classification_type": "",
    "pic_link": ""
  },

  "Chromodoris_annae": {
    "species_name": "Chromodoris annae",
    "common_name": "Anna's magnificent sea slug",
    "image_filename": "Chromodoris_annae.jpg",
    "location": "Central Indo-Pacific region (Malaysia, Indonesia, Philippines, Marshall Islands)",
    "depth_m": "15-30",
    "habitat": "Coral reefs, shallow coastal shoreline, mangroves, seagrasses",
    "size_mm": "50",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (Petrosaspongia sp.)",
    "interesting_facts": "Known for absorbing noxious chemicals from its sponge diet (Petrosaspongia sp.) and storing them in mantle glands for defense against predators. Its vibrant coloration is also believed to be aposematic. One reported case of intraspecific aggression involved two individuals lunging and biting each other.",
    "color_notes": "Main body color varies from blue-grey to intense blue, slightly speckled with tiny black spots. Blue dorsal side and foot bordered with a black line (can be discontinuous). A black dash between the rhinophores distinguishes it. Mantle edge and foot bordered with white and orange to yellow lines. Gills and rhinophores are orange to yellow.",
    "classification_type": "",
    "pic_link": ""
  },

  "Hexabranchus_sanguineus": {
    "species_name": "Hexabranchus sanguineus",
    "common_name": "Spanish Dancer",
    "image_filename": "Hexabranchus_sanguineus.jpg",
    "location": "Tropical Indo-Pacific (East Africa, Red Sea, French Polynesia, Japan, Australia)",
    "depth_m": "20-50",
    "habitat": "Coral reefs, rocky reefs, rubble, and sandy areas",
    "size_mm": "400",
    "taxonomy": {
      "family": "Hexabranchidae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (non-selective feeder, preys on at least 11 genera of sponges)",
    "interesting_facts": "One of the largest known nudibranch species, growing up to 40 cm. It can swim away by flapping its appendages when threatened, resembling a flamenco dancer, which earned it the name 'Spanish Dancer'. It also secretes a potent chemical derived from sponges for defense, which is passed to its egg ribbons.",
    "color_notes": "Usually mottled red with hints of whites, oranges, and pinks. Its bright warning colors act as predator deterrents.",
    "classification_type": "",
    "pic_link": ""
  },

  "Phyllidia_varicosa": {
    "species_name": "Phyllidia varicosa",
    "common_name": "Scrambled egg nudibranch, Fried egg nudibranch, Varicose Phyllidia",
    "image_filename": "Phyllidia_varicosa.jpg",
    "location": "Indo-West Pacific Oceans (including central Pacific, Red Sea, Hawaii)",
    "depth_m": "1-49",
    "habitat": "Open on rocks, sand in Halimeda kanaloana beds (with rubble)",
    "size_mm": "115",
    "taxonomy": {
      "family": "Phyllidiidae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (observed feeding on a cream sponge)",
    "interesting_facts": "Juveniles of the sea cucumber, Pearsonothuria graeffei, brightly colored, closely resemble and mimic this nudibranch to gain protection from predators due to the nudibranch's toxicity. It is one of the most frequently noticed nudibranchs by divers.",
    "color_notes": "Elongate-oval with three to six longitudinal, blue-gray ridges composed of smooth, yellow-capped tubercles. Crescent-shaped, blue-gray areas with black spots and yellow-capped tubercles around mantle margin. Rhinophores are yellow. Medial, black longitudinal stripe on the sole of the foot. Occasional animals may have little or no yellow on the tubercles.",
    "classification_type": "",
    "pic_link": ""
  },

  "Flabellina_affinis": {
    "species_name": "Flabellina affinis",
    "common_name": "Violet Flabellina",
    "image_filename": "Flabellina_affinis.jpg",
    "location": "European waters in the Atlantic Ocean (Portugal to Ghana, Canaries) and widespread in the Mediterranean Sea",
    "depth_m": "50",
    "habitat": "Rocky bottoms, associated with hydroids",
    "size_mm": "50",
    "taxonomy": {
      "family": "Flabellinidae",
      "order": "Nudibranchia"
    },
    "diet": "Hydroids (Eudendrium species)",
    "interesting_facts": "Type species of the genus Flabellina. Often confused with Paraflabellina ischitana, but can be distinguished by the opaque violet coloration beneath the subapical white ring on its cerata, where the digestive gland is not visible.",
    "color_notes": "Body and cerata are typically purple/violet with white tips. The outer part of the digestive gland in each ceras is not visible as the area beneath the subapical white ring is opaque violet in color. Rhinophores are orange.",
    "classification_type": "",
    "pic_link": ""
  },

  "Hypselodoris_apolegma": {
    "species_name": "Hypselodoris apolegma",
    "common_name": "Bubblegum Worm",
    "image_filename": "Hypselodoris_apolegma.jpg",
    "location": "Tropical Western Pacific Ocean, Indo-West Pacific Ocean",
    "depth_m": "2-30",
    "habitat": "Shallow coastal reefs",
    "size_mm": "50",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Yellow sponges (Euryspongia genus)",
    "interesting_facts": "Commonly known as 'Bubblegum Worm'. Its diet is highly specialized, feeding exclusively on yellow sponges of the genus Euryspongia, making it unsuitable for home aquariums without this specific food source. Recent phylogenetic data confirm its validity and suggest a sister species relationship with Hypselodoris bullockii or Hypselodoris brycei.",
    "color_notes": "Pinkish-purple body with white spots. Mantle edge, rhinophores, and gills are orange or red.",
    "classification_type": "",
    "pic_link": ""
  },

  "Thecacera_pacifica": {
    "species_name": "Thecacera pacifica",
    "common_name": "Pikachu nudibranch",
    "image_filename": "Thecacera_pacifica.jpg",
    "location": "African coast of the Indian Ocean (Mozambique) to Indonesia and Vanuatu. Also reported from the Gulf of Mexico, Atlantic Ocean.",
    "depth_m": "1-30",
    "habitat": "Coral reefs, rocky reefs, and sandy bottoms",
    "size_mm": "30",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "",
    "interesting_facts": "Sometimes nicknamed the 'Pikachu nudibranch' due to its resemblance to the Pokémon character. It has a wide distribution, including both Indo-Pacific and Atlantic Oceans.",
    "color_notes": "Translucent orange body with black tips to the rhinophores and gills. Rhinophore sheaths edged with black with a patch of blue at the widest part. Blue color also present at the tip of the tail and at the tip of the lateral papillae beside the gills, separated from the orange by a black band. Some specimens have black linear marks on the body with blue centers.",
    "classification_type": "",
    "pic_link": ""
  },

  "Ceratosoma_amoenum": {
    "species_name": "Ceratosoma amoenum",
    "common_name": "Clown nudibranch, Sweet Ceratosoma",
    "image_filename": "Ceratosoma_amoenum.jpg",
    "location": "Temperate southern Australia and northern New Zealand, with some sightings off southern Queensland",
    "depth_m": "3-20",
    "habitat": "Intertidal zones, subtidal, sublittoral, infralittoral",
    "size_mm": "60",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (Semitaspongia and Dysidea fragilis)",
    "interesting_facts": "Commonly known as the 'Clown Nudibranch'. It sequesters metabolites from its sponge prey (Semitaspongia and Dysidea fragilis) as a defense mechanism. The size of its spots varies by geographic range, with New Zealand individuals having the largest.",
    "color_notes": "White body elaborately patterned with orange and purple spots, especially on the dorsum. The size of the spots varies. Gills and rhinophores are crimson-white in color and can be retracted into pockets. Large concentration of mantle glands at the rear of the mantle.",
    "classification_type": "",
    "pic_link": ""
  },

  "Hypselodoris_tryoni": {
    "species_name": "Hypselodoris tryoni",
    "common_name": "Tryon's Hypselodoris",
    "image_filename": "Hypselodoris_tryoni.jpg",
    "location": "Tropical Western Pacific Ocean, from Australia to the Philippines; specific sightings in Marshall Islands (Enewetak and Kwajalein Atolls).",
    "depth_m": "2-30",
    "habitat": "Benthic zone, commonly found on pilings, lagoon pinnacles, interisland subtidal reefs, near sponges.",
    "size_mm": "50",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges, specifically from the family Dysideidae.",
    "interesting_facts": "Known for its 'trailing' or 'queuing' behavior, where individuals follow each other closely. Sometimes found in a commensal relationship with the emperor shrimp (Periclimenes imperator). Often observed exposed during the day.",
    "color_notes": "Brown body with a white foot, adorned with distinct purple spots that are often ringed with white or light-brown. The gills are translucent white or light-brown, and the rhinophores are brown to dark-brown with circular white lines. A thin blue or purple line typically outlines the mantle edge.",
    "classification_type": "",
    "pic_link": ""
  },

  "Hypselodoris_variobranchia": {
    "species_name": "Hypselodoris variobranchia",
    "common_name": "Variegated-Gill Hypselodoris",
    "image_filename": "Hypselodoris_variobranchia.jpg",
    "location": "Indo-Pacific region, including Queensland (Australia), Malaysia, Indonesia, and Okinawa (Japan). Holotype collected from the Philippines.",
    "depth_m": "5-20",
    "habitat": "Marine, likely coral or rocky reefs, associated with sponges.",
    "size_mm": "50",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (likely Dysideidae or Thorectidae, based on genus characteristics).",
    "interesting_facts": "Frequently mistaken for other similar-looking species such as Hypselodoris bullocki or Hypselodoris apolegma.",
    "color_notes": "Characterized by a deep purple body with a broad, solid white border on the mantle. The rhinophore bulb is orange with purple sheaths, and the gills can be either orange or deep purple. The tall gill pocket is distinctly deep purple.",
    "classification_type": "",
    "pic_link": ""
  },

  "Bornella_anguilla": {
    "species_name": "Bornella anguilla",
    "common_name": "Snakey Nudibranch, Eel Bornella",
    "image_filename": "Bornella_anguilla.jpg",
    "location": "Widespread Indo-West Pacific, from the East Coast of Africa to Hawaii, including Australia, Indonesia, Kenya, Marshall Islands, Mauritius, Micronesia, New Caledonia, Philippines, Reunion, South Africa, Taiwan, and Tanzania.",
    "depth_m": "0-18",
    "habitat": "Subtidal and sublittoral zones, often found between or under soft corals.",
    "size_mm": "75",
    "taxonomy": {
      "family": "Bornellidae",
      "order": "Nudibranchia"
    },
    "diet": "Exclusively hydroids.",
    "interesting_facts": "Named 'anguilla' (eel) due to its distinctive ability to swim by undulating its body. It may absorb the stinging cells (nematocysts) from its hydroid prey for its own defense.",
    "color_notes": "Displays an intricate mosaic pattern of various sized brown, white, and yellow circles. The body is long and slender, featuring paired appendages (penial spines) with gills. The rhinophores are located on the first pair of appendages, and small tentacles are present around the mouth. When swimming, the tops of its appendages fold shut and can appear red.",
    "classification_type": "",
    "pic_link": ""
  },

  "Phyllidia_ocellata": {
    "species_name": "Phyllidia ocellata",
    "common_name": "Ocellated Wart Slug",
    "image_filename": "Phyllidia_ocellata.jpg",
    "location": "Widespread Indo-Pacific region, including the Red Sea, Indonesia, Malaysia, and the Solomon Islands.",
    "depth_m": "15-35",
    "habitat": "Marine, primarily coral reefs.",
    "size_mm": "60",
    "taxonomy": {
      "family": "Phyllidiidae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges. It lacks a radula and instead secretes digestive enzymes to consume its prey.",
    "interesting_facts": "This species is toxic, and its vibrant colors and patterns serve as a warning (aposematism) to potential predators. Its dorsal tubercles can exude a milky defensive secretion derived from its sponge diet. Exhibits high variability in its color and pattern.",
    "color_notes": "Features a golden yellow background with several large, roundish black ocelli (4-10) each encircled by a white ring. Small to large yellow or white hard tubercles are irregularly distributed over the dorsum. The rhinophores are golden yellow. Ventrally, it has a grey hyponotum, secondary gills, and a foot sole with gold-tipped oral tentacles.",
    "classification_type": "",
    "pic_link": ""
  },

  "Glossodoris_cincta": {
    "species_name": "Glossodoris cincta",
    "common_name": "Girdled Glossodoris",
    "image_filename": "Glossodoris_cincta.jpg",
    "location": "Indo-West Pacific, with reliable recent records from the Central Indian Ocean and Réunion. Its distribution is often confused with similarly colored species.",
    "depth_m": "10-43",
    "habitat": "Marine, likely coral or rocky reefs, associated with sponges.",
    "size_mm": "55",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (likely, based on family characteristics).",
    "interesting_facts": "Its name has been extensively applied to a group of similarly colored species, leading to frequent misidentifications.",
    "color_notes": "The mantle and foot are typically orange and cream-colored, both encircled by distinctive blue and white bands. The mantle is tawny brown with blue-white dots and a dark blue margin, separated by a thin grey line. Rhinophores are dark brown with blue-white dots.",
    "classification_type": "",
    "pic_link": ""
  },

  "Mexichromis_macropus": {
    "species_name": "Mexichromis macropus",
    "common_name": "Bigfoot sea-slug",
    "image_filename": "Mexichromis_macropus.jpg",
    "location": "Endemic to temperate and subtropical southeastern and southwestern Australia, including SW Western Australia, South Australia, Tasmania, Victoria, and New South Wales.",
    "depth_m": "5-20",
    "habitat": "Subtidally on hard substrates, typically associated with sponges.",
    "size_mm": "50",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges in the genus Dysidea.",
    "interesting_facts": "This species is generally found infrequently (occurring at only about 1.5% of surveyed sites) and is typically observed as solitary individuals.",
    "color_notes": "The mantle color ranges from white to pink-purple, adorned with scattered pointed papillae that are tipped in purple. The mantle border features radially arranged orange or yellow-orange stripes.",
    "classification_type": "",
    "pic_link": ""
  },

  "Aegires_villosus": {
    "species_name": "Aegires villosus",
    "common_name": "Shaggy Aegires",
    "image_filename": "Aegires_villosus.jpg",
    "location": "Widespread Indo-West Pacific, with documented sightings in the Philippines, Tonga, South Australia, and New Caledonia.",
    "depth_m": "0-12",
    "habitat": "Benthic environments including rocky bottoms, silty bottoms with dense gorgonian beds, and intertidal reef crests.",
    "size_mm": "20",
    "taxonomy": {
      "family": "Aegiridae",
      "order": "Nudibranchia"
    },
    "diet": "Calcareous sponges.",
    "interesting_facts": "A small species, easily recognizable by its purple-tipped papillae. Its gills are often difficult to spot due to their small size and camouflage. Juveniles have proportionally longer papillae than adults.",
    "color_notes": "The body is generally a base color (often whitish or yellowish) with distinctive long purple-tipped papillae. The feather-like gills are whitish and almost transparent, contributing to their camouflaged appearance.",
    "classification_type": "",
    "pic_link": ""
  },

  "Felimare_picta": {
    "species_name": "Felimare picta",
    "common_name": "Regal Sea Goddess",
    "image_filename": "Felimare_picta.jpg",
    "location": "Mediterranean Sea, European Atlantic (e.g., Portugal, Spain, British Isles), Gulf of Mexico, Eastern North Atlantic (Amphi-Atlantic distribution).",
    "depth_m": "0-55",
    "habitat": "Rocky seabeds, tide pools, shallow sheltered areas, on rocky substrates.",
    "size_mm": "100",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges, specifically species from the genus Dysidea.",
    "interesting_facts": "This species is notable for its large size, often exceeding 10 cm. It displays striking dark blue or purplish coloration with yellow or orange lines and spots. As a defensive mechanism, it sequesters noxious chemicals from the sponges it consumes, making it unpalatable to predators. It has a relatively longer planktonic larval phase which aids in its wide dispersal across the Atlantic.",
    "color_notes": "Highly variable, but generally dark blue/purple with bright yellow/orange markings. Some variations include white and black. Possesses an external crown-like gill plume and prominent rhinophores.",
    "classification_type": "",
    "pic_link": ""
  },

  "Janolus_savinkini": {
    "species_name": "Janolus savinkini",
    "common_name": "Purple-tipped Janolus, Savinkin's Janolus",
    "image_filename": "Janolus_savinkini.jpg",
    "location": "Indo-Pacific region, including East Asian waters such as Indonesia, Japan (Okinawa), Papua New Guinea, Philippines, and Tanzania.",
    "depth_m": "15-200",
    "habitat": "Subtidal marine environments, often associated with its bryozoan prey.",
    "size_mm": "30",
    "taxonomy": {
      "family": "Janolidae",
      "order": "Nudibranchia"
    },
    "diet": "Bryozoans (sea mats).",
    "interesting_facts": "A specialist carnivore feeding exclusively on bryozoans. It is characterized by its yellowish body with light orange hues and numerous cerata, each featuring a broad purplish subterminal ring and a distinctive bright opaque blue spot at the tip. Specific defensive mechanisms are not explicitly detailed, but as an aeolid nudibranch, it likely produces or sequesters defensive compounds.",
    "color_notes": "Yellowish body with orange tones, cerata with purple subterminal rings and bright opaque blue spots at the tips. Possesses large, papillate rhinophores.",
    "classification_type": "",
    "pic_link": ""
  },

  "Goniobranchus_geminus": {
    "species_name": "Goniobranchus geminus",
    "common_name": "Gem Sea Slug",
    "image_filename": "Goniobranchus_geminus.jpg",
    "location": "Indian Ocean (from East African coast to Sri Lanka) and the Red Sea.",
    "depth_m": "0-50",
    "habitat": "External slopes of coral reefs.",
    "size_mm": "50",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (spongivore).",
    "interesting_facts": "Known for its distinctive mantle edge with four concentric colored lines (white, grayish, white, golden yellow) and mauve ocelli on its body. As a chromodorid, it employs chemical defenses by sequestering toxic compounds from its sponge diet, which are advertised by its striking aposematic coloration.",
    "color_notes": "Light brown or yellowish body with mauve ocelli. Mantle edge has four distinct lines: outermost white, then grayish, then white, then golden yellow. Yellow or purple laminated rhinophores and white gills with a beige outline.",
    "classification_type": "",
    "pic_link": ""  
},

"Polycera_quadrilineata": {
    "species_name": "Polycera quadrilineata",
    "common_name": "Fourline Nudibranch",
    "image_filename": "Polycera_quadrilineata.jpg",
    "location": "Widespread in the Northeast Atlantic (Greenland, Norway, European coasts, Mediterranean Sea) and also recorded from the South African coast (part of a cryptic species complex).",
    "depth_m": "0-300",
    "habitat": "Shallow water environments, often associated with kelp and red algae where its bryozoan prey is found.",
    "size_mm": "50",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "Bryozoans, particularly Membranipora membranacea and Electra pilosa.",
    "interesting_facts": "This species exhibits aposematic coloration and possesses defensive spicules embedded in its body wall, especially concentrated around the visceral mass in juveniles, providing a form of 'armor'. Its specific diet on bryozoans influences its distribution. Reproduction involves short, curved egg ribbons and planktotrophic larvae.",
    "color_notes": "Translucent white or grey body marked with distinctive yellow, orange, or black longitudinal stripes. Possesses 4-6 prominent oral veil processes and usually 4-6 processes near the gills, often tipped with orange or yellow. Rhinophores and gills are typically translucent white with yellow tips.",
    "classification_type": "",
    "pic_link": ""
  },

  "Fjordia_lineata": {
    "species_name": "Fjordia lineata",
    "common_name": "Striped Aeolid Nudibranch",
    "image_filename": "Fjordia_lineata.jpg",
    "location": "Northeast Atlantic, including the British Isles, Norway, and the Mediterranean Sea.",
    "depth_m": "0-50",
    "habitat": "Rocky substrates, often found on or near its hydroid prey.",
    "size_mm": "30",
    "taxonomy": {
      "family": "Flabellinidae",
      "order": "Nudibranchia"
    },
    "diet": "Hydroids, specifically known to consume Tubularia indivisa.",
    "interesting_facts": "As an aeolid nudibranch, it is highly likely to sequester undischarged nematocysts (stinging cells) from the hydroids it consumes and relocate them to the tips of its cerata for defense. Its elongated body is typically brown or yellowish with distinctive longitudinal lines.",
    "color_notes": "Body typically brown or yellowish with distinctive longitudinal lines or stripes. Numerous cerata covering its back are lined with bright yellow or orange pigment.",
    "classification_type": "",
    "pic_link": ""},

  "Hermissenda_crassicornis": {
    "species_name": "Hermissenda crassicornis",
    "common_name": "Horned Aeolid, Hermissenda",
    "image_filename": "Hermissenda_crassicornis.jpg",
    "location": "Widespread along the Pacific coast of North America (from Sitka, Alaska, to Baja California) and also found in the Arctic Ocean.",
    "depth_m": "0-35",
    "habitat": "Diverse habitats including rocky pools, marina floats, pilings, and mud flats.",
    "size_mm": "100",
    "taxonomy": {
      "family": "Facelinidae",
      "order": "Nudibranchia"
    },
    "diet": "Highly carnivorous and opportunistic, feeding on hydroids, small sea anemones, bryozoans, worms, small crustaceans, tiny clams, and dead animals. Known for ingesting and utilizing nematocysts from cnidarian prey.",
    "interesting_facts": "A key defensive mechanism is the sequestration of undischarged nematocysts from its cnidarian prey, which are then deployed from the tips of its cerata. It is an important predator in its ecosystem due to its broad diet. Its lifespan can range from a few weeks to about a year.",
    "color_notes": "Distinctive bright orange and bluish-white longitudinal stripes running along its body. Possesses two pairs of prominent rhinophores and numerous iridescent cerata covering its back.",
    "classification_type": "",
    "pic_link": ""
  },  

  "Ceratosoma_tenue": {
    "species_name": "Ceratosoma tenue",
    "common_name": "Colourful Dorid Nudibranch, Elongate Pantechnicon Dorid, Kangaroo Nudibranch",
    "location": "Widespread throughout the Indo-Pacific region, from the Oriental African coast eastward to Hawaii, and across Southeast Asia and tropical Australia.",
    "depth_m": "0.5-40",
    "habitat": "Diverse marine environments, commonly found among shallow coral reefs, moderately exposed to exposed rocky habitats.",
    "size_mm": "100",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges, particularly species from the genus Dysidea.",
    "interesting_facts": "This species exhibits remarkably variable and bright coloration, making each individual almost unique. It possesses a prominent, curved 'horn' at its posterior end which contains defensive glands that release noxious chemicals. This 'horn' may also serve as a lure. It is a specialized predator of sponges and can host commensal shrimp.",
    "color_notes": "Highly variable and bright coloration, ranging from pinky-orange with yellow spots to olive-green or even violet margins. Has three distinct mantle lobes. Both its gills and rhinophores are fully retractile.",
    "classification_type": "",
    "pic_link": ""
  },  

  "Felimare_californiensis": {
    "species_name": "Felimare californiensis",
    "common_name": "California blue dorid, California nudibranch",
    "image_filename": "Felimare_californiensis.jpg",
    "location": "Eastern Pacific Ocean, Californian coast (Monterey Bay through Baja California). Experienced regional extinction in northern range around 1982, reappeared in 2003.",
    "depth_m": "Intertidal to subtidal, near sponges",
    "habitat": "Rocky intertidal zones and subtidal habitats, preferring areas with abundant food supply and suitable surfaces to cling to, typically covered in sponges.",
    "size_mm": "100",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Dysideid sponges.",
    "interesting_facts": "Vibrant blue, yellow, and white hues serve as aposematic (warning) coloration. It is hermaphroditic and lays spiral, ribbon-like egg masses. Known for its slow-moving lifestyle and unpalatability.",
    "color_notes": "Vibrant blue body with yellow and white markings. Often has orange or yellow lines along the mantle edge and on the rhinophores and gills.",
    "classification_type": "",
    "pic_link": ""
  },  

  "Tambja_verconis": {
    "species_name": "Tambja verconis",
    "common_name": "Verco's Nudibranch",
    "image_filename": "Tambja_verconis.jpg",
    "location": "New Zealand and southern Australia.",
    "depth_m": "0-50",
    "habitat": "Rocky reefs, pier piles, sponge gardens, typically found on or near its host bryozoan.",
    "size_mm": "120",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "Bugula dentata (a specific dark blue-green bryozoan).",
    "interesting_facts": "A large nudibranch with striking coloration, often exhibiting iridescent qualities. It is a highly specialized feeder. Lays bright yellow spiral coil of eggs.",
    "color_notes": "Striking color patterns of yellow and/or blue, often with electric blue lines or spots. Rhinophores and gills are typically the same vibrant colors as the body.",
    "classification_type": "",
    "pic_link": ""
  },

  "Hypselodoris_decorata": {
    "species_name": "Hypselodoris decorata",
    "common_name": "Spotted Hypselodoris",
    "image_filename": "Hypselodoris_decorata.jpg",
    "location": "Indo-Pacific: New Caledonia, Marshall Islands, Vanuatu, Indonesia, Papua New Guinea, Philippines, Malaysia.",
    "depth_m": "5-40",
    "habitat": "Subtidal, sublittoral, infralittoral, and deep zone; commonly found on coral reefs, rocky reefs, and seaward-facing reefs.",
    "size_mm": "30",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges (food specialist).",
    "interesting_facts": "Its distinct coloration includes complex patterns of lines and spots. Not generally suitable for aquarium keeping. Its potential toxic hazard is unknown.",
    "color_notes": "Translucent cream to pink body with a brown longitudinal band, intricate white lines, and distinct red or purple spots. Anterior end often light-purple. Gills with red-orange pigment; rhinophores white with red bands.",
    "classification_type": "",
    "pic_link": ""
  },

  "Hypselodoris_infucata": {
    "species_name": "Hypselodoris infucata",
    "common_name": "Painted nudibranch",
    "image_filename": "Hypselodoris_infucata.jpg",
    "location": "Red Sea and western Indian Ocean eastwards to Hawaiian islands, tropical Indo-West Pacific. Also reported as a Lessepsian migrant in the Mediterranean Sea.",
    "depth_m": "Infralittoral zone",
    "habitat": "Rocky bottoms of the infralittoral zone, showing tolerance to harbor conditions.",
    "size_mm": "50",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges.",
    "interesting_facts": "Reproduction and larval development have been studied, showing veliger larvae hatch after about 5 days with a planktonic life of about 3 weeks. Distinguished from similar species by its gill structure.",
    "color_notes": "Translucent white body with grey-blue blotches, large yellow spots, and small black spots. Gills white with red pigment; rhinophores opaque white with red edges or a red line.",
    "classification_type": "",
    "pic_link": ""  
  },

  "Tambja_blacki": {
    "species_name": "Tambja blacki",
    "common_name": "Black Tambja",
    "location": "Generally recorded from the Great Barrier Reef (Australia), Papua New Guinea, with recent findings in Indonesia.",
    "depth_m": "5-30",
    "habitat": "Likely associated with reefs where its specific bryozoan diet is abundant.",
    "size_mm": "130",
    "taxonomy": {
      "family": "Polyceridae",
      "order": "Nudibranchia"
    },
    "diet": "Believed to feed upon the arborescent bryozoan Amastigia rudis.",
    "interesting_facts": "Notable for its large size and distinctive patterning. Uniquely, it is known to swim readily by strong side-to-side flexions of its body when irritated. Rhinophores can fold posteriorly and gills contract for streamlining during swimming.",
    "color_notes": "Distinctive patterning and coloration (specific details vary, but generally dark body with bright contrasting markings).",
    "classification_type": "",
    "pic_link": ""
  },

  "Hypselodoris_obscura": {
    "species_name": "Hypselodoris obscura",
    "common_name": "Mottled Hypselodoris",
    "location": "Southeastern Australia (warm temperate species).",
    "depth_m": "Not explicitly stated, likely consistent with rocky reefs",
    "habitat": "Likely rocky reefs within its distributional range, consistent with its sponge diet.",
    "size_mm": "60",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges.",
    "interesting_facts": "Its mottled appearance provides camouflage against certain backgrounds. Closely related to other Hypselodoris species like H. infucata and H. saintvincentius. Observed as infrequent and solitary.",
    "color_notes": "Mottled appearance with a grey or grey-blue background adorned with yellow and black spots. Often has a paler midline stripe. Mantle edge shows alternating pale blue and yellow. Gills and rhinophores are bright red.",
    "classification_type": "",
    "pic_link": ""
  },  

  "Chromodoris_magnifica": {
    "species_name": "Chromodoris magnifica",
    "common_name": "Magnificent sea slug",
    "image_filename": "Chromodoris_magnifica.jpg",
    "location": "Central Indo-Pacific region, including Indonesia, Philippines, New Guinea, Eastern Australia (Queensland), and Okinawa (Japan).",
    "depth_m": "5-30",
    "habitat": "Coral reefs.",
    "size_mm": "80",
    "taxonomy": {
      "family": "Chromodorididae",
      "order": "Nudibranchia"
    },
    "diet": "Sponges, specifically Negombata sp. (Podospongiidae) and possibly Lamellodysidea. Obtains toxic compounds (e.g., Latrunculin A) from diet.",
    "interesting_facts": "Living up to its name, this species is incredibly vibrant and displays strong aposematic (warning) coloration. It is involved in Müllerian mimicry with other similarly colored species. Lays eggs in a distinctive planar (flat) ribbon mass.",
    "color_notes": "Bluish-white body with two prominent continuous black longitudinal lines, a median continuous line, and a white mantle margin bordered by an orange line. Gills and rhinophores are bright orange and are retractible.",
    "classification_type": "",
    "pic_link": ""  
  }
}
